In [1]:
import pandas as pd

In [2]:
!pip install pymongo
!pip install pymongo[srv]

Requirement already satisfied: pymongo in c:\users\madhu\anaconda3\lib\site-packages (3.12.0)
Requirement already satisfied: pymongo[srv] in c:\users\madhu\anaconda3\lib\site-packages (3.12.0)
Requirement already satisfied: dnspython<2.0.0,>=1.16.0 in c:\users\madhu\anaconda3\lib\site-packages (from pymongo[srv]) (1.16.0)

In [3]:
from pymongo.mongo_client import MongoClient
from pymongo.server_api import ServerApi
uri = "mongodb+srv://nayakdebasish7205:debu7205@cluster0.leof6cp.mongodb.net/?retryWrites=true&w=majority"

In [4]:
# Create a new client and connect to the server
client = MongoClient(uri, server_api=ServerApi('1'))

In [5]:
# Send a ping to confirm a successful connection
try:
    client.admin.command('ping')
    print("Pinged your deployment. You successfully connected to MongoDB!")
except Exception as e:
    print(e)

Pinged your deployment. You successfully connected to MongoDB!

In [58]:
client.list_database_names()

['mydatabase', 'admin', 'local']

In [104]:
mydb=client["mydatabase"]

In [60]:
mycol=mydb["myfirstcollection"]

In [61]:
abc=mycol.find()

In [62]:
type(abc)

pymongo.cursor.Cursor

In [63]:
for x in mycol.find():
    print(x)

{'_id': ObjectId('64ec3262d6b3465fd1b002a5'), 'First_Name': 'Debu', 'Last_Name': 'Nayak', 'ID': 101, 'Age': 21}
{'_id': ObjectId('64ec336cd6b3465fd1b002a6'), 'First_Name': 'Krish', 'Last_Name': 'Naik', 'ID': 102, 'Age': 32}
{'_id': ObjectId('64ec336cd6b3465fd1b002a7'), 'First_Name': 'Ranjit', 'Last_Name': 'Maity', 'ID': 103, 'Age': 26}
{'_id': ObjectId('64ec38e2d6b3465fd1b002a9'), 'First_Name': 'Rahul', 'Last_Name': 'Savita', 'ID': 104, 'Age': 28}

In [33]:
type(mycol["myfirstcollection"])

pymongo.collection.Collection

In [64]:
documents = list(abc)
ddf=pd.DataFrame(documents)
ddf.head()

                        _id First_Name Last_Name   ID  Age
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32
2  64ec336cd6b3465fd1b002a7     Ranjit     Maity  103   26
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28

In [65]:
ddf["Last_Name"]

0     Nayak
1      Naik
2     Maity
3    Savita
Name: Last_Name, dtype: object

In [66]:
ddf["First_Name"]

0      Debu
1     Krish
2    Ranjit
3     Rahul
Name: First_Name, dtype: object

In [69]:
ddf[ddf["First_Name"]=="Debu"]

                        _id First_Name Last_Name   ID  Age
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21

In [72]:
ddf[ddf["Age"]==21]

                        _id First_Name Last_Name   ID  Age
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21

In [78]:
ddf[["First_Name","Last_Name"]]

  First_Name Last_Name
0       Debu     Nayak
1      Krish      Naik
2     Ranjit     Maity
3      Rahul    Savita

In [81]:
ddf[["First_Name","ID"]]

  First_Name   ID
0       Debu  101
1      Krish  102
2     Ranjit  103
3      Rahul  104

In [85]:
ddf[ddf["ID"]==102]

                        _id First_Name Last_Name   ID  Age
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32

In [88]:
ddf[['Age']]

   Age
0   21
1   32
2   26
3   28

In [89]:
ddf[["Age"]].min()

Age    21
dtype: int64

In [90]:
ddf[["Age"]].max()

Age    32
dtype: int64

In [105]:
collection=mydb["mysecondcoll"]

In [106]:
if collection.exists():
    print('Collection already exists')
else:
    print('Creating new collection')
    collection.create_collection()

TypeError: 'Collection' object is not callable. If you meant to call the 'exists' method on a 'Collection' object it is failing because no such method exists.

In [107]:
collection.insert_many(ddf.to_dict('records'))

In [110]:
collection.find_one()

{'_id': ObjectId('64ec3262d6b3465fd1b002a5'),
 'First_Name': 'Debu',
 'Last_Name': 'Nayak',
 'ID': 101,
 'Age': 21}

In [112]:
data=list(collection.find())
df=pd.DataFrame(data)

In [113]:
df

                        _id First_Name Last_Name   ID  Age
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32
2  64ec336cd6b3465fd1b002a7     Ranjit     Maity  103   26
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28

In [114]:
df["city"]=["Delhi","Mumbai","Hyderabad","Bangalore"]

In [115]:
df

                        _id First_Name Last_Name   ID  Age       city
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21      Delhi
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32     Mumbai
2  64ec336cd6b3465fd1b002a7     Ranjit     Maity  103   26  Hyderabad
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28  Bangalore

In [116]:
collection.find_one()

{'_id': ObjectId('64ec3262d6b3465fd1b002a5'),
 'First_Name': 'Debu',
 'Last_Name': 'Nayak',
 'ID': 101,
 'Age': 21}

In [117]:
df[["city"]]

        city
0      Delhi
1     Mumbai
2  Hyderabad
3  Bangalore

In [119]:
df[df["city"]=="Delhi"]

                        _id First_Name Last_Name   ID  Age   city
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21  Delhi

In [133]:
for x in df["Age"]:
     if x >= 25:
            print(x)

32
26
28

In [140]:
df[df["ID"]==101]

                        _id First_Name Last_Name   ID  Age   city
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21  Delhi

In [154]:
df1=df.T

In [155]:
df1.loc["First_Name"]

0      Debu
1     Krish
2    Ranjit
3     Rahul
Name: First_Name, dtype: object

In [146]:
df

                        _id First_Name Last_Name   ID  Age       city
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21      Delhi
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32     Mumbai
2  64ec336cd6b3465fd1b002a7     Ranjit     Maity  103   26  Hyderabad
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28  Bangalore

In [156]:
df.loc[3]

_id           64ec38e2d6b3465fd1b002a9
First_Name                       Rahul
Last_Name                       Savita
ID                                 104
Age                                 28
city                         Bangalore
Name: 3, dtype: object

In [158]:
df.iloc[1:,2:]

  Last_Name   ID  Age       city
1      Naik  102   32     Mumbai
2     Maity  103   26  Hyderabad
3    Savita  104   28  Bangalore

In [161]:
df.iloc[1]

_id           64ec336cd6b3465fd1b002a6
First_Name                       Krish
Last_Name                         Naik
ID                                 102
Age                                 32
city                            Mumbai
Name: 1, dtype: object

In [162]:
df1.iloc[2:,2:]

                   2          3
Last_Name      Maity     Savita
ID               103        104
Age               26         28
city       Hyderabad  Bangalore

In [182]:
collection.update_many({},{'$set':{'city':'Delhi','Mumbai','Hydereabad','Bangalore'}})

SyntaxError: ':' expected after dictionary key (1143303623.py, line 1)

In [184]:
df[["city"]]

        city
0      Delhi
1     Mumbai
2  Hyderabad
3  Bangalore

In [186]:
df[df["city"]=="Bangalore"]

                        _id First_Name Last_Name   ID  Age       city
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28  Bangalore

In [188]:
df[df["First_Name"]=="Krish"]

                        _id First_Name Last_Name   ID  Age    city
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32  Mumbai

In [189]:
df[df["ID"]==101]

                        _id First_Name Last_Name   ID  Age   city
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21  Delhi

In [190]:
df[["Last_Name"]]

  Last_Name
0     Nayak
1      Naik
2     Maity
3    Savita

In [191]:
df.loc[2]

_id           64ec336cd6b3465fd1b002a7
First_Name                      Ranjit
Last_Name                        Maity
ID                                 103
Age                                 26
city                         Hyderabad
Name: 2, dtype: object

In [192]:
df.loc[1]

_id           64ec336cd6b3465fd1b002a6
First_Name                       Krish
Last_Name                         Naik
ID                                 102
Age                                 32
city                            Mumbai
Name: 1, dtype: object

In [193]:
df.iloc[0:,0:]

                        _id First_Name Last_Name   ID  Age       city
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21      Delhi
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32     Mumbai
2  64ec336cd6b3465fd1b002a7     Ranjit     Maity  103   26  Hyderabad
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28  Bangalore

In [198]:
df.iloc[0:]

                        _id First_Name Last_Name   ID  Age       city
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21      Delhi
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32     Mumbai
2  64ec336cd6b3465fd1b002a7     Ranjit     Maity  103   26  Hyderabad
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28  Bangalore

In [200]:
df.iloc[::-1]

                        _id First_Name Last_Name   ID  Age       city
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28  Bangalore
2  64ec336cd6b3465fd1b002a7     Ranjit     Maity  103   26  Hyderabad
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32     Mumbai
0  64ec3262d6b3465fd1b002a5       Debu     Nayak  101   21      Delhi

In [201]:
df.iloc[1:]

                        _id First_Name Last_Name   ID  Age       city
1  64ec336cd6b3465fd1b002a6      Krish      Naik  102   32     Mumbai
2  64ec336cd6b3465fd1b002a7     Ranjit     Maity  103   26  Hyderabad
3  64ec38e2d6b3465fd1b002a9      Rahul    Savita  104   28  Bangalore